app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])
    # @article.update(title: params[:title], description: params[:description])
    @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-03-16 21:28:50.797935"], ["id", 1]]